################################################################################
# Applications
################################################################################

# Video conferencing
cask "zoom"                                     # Video communication and virtual meeting platform
cask "homebrew/cask-drivers/garmin-express"     # Garmin desktop tool

################################################################################
# Development
################################################################################

# EmptyEpsilon
brew "cmake"                                    # Cross-platform make
brew "sdl2"                                     # Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "mingw-w64"                                # Minimalist GNU for Windows and GCC cross-compilers
cask "wine-stable"                              # Compatibility layer to run Windows applications
brew "llvm"                                     # Next-gen compiler infrastructure
brew "libopusenc"                               # Convenience library for creating .opus files
brew "sfml"                                     # Multi-media library with bindings for multiple languages
brew "glm"                                      # C++ mathematics library for graphics software

# Containers
brew "lazydocker"                               # The lazier way to manage everything docker

# Game dev
cask "godot"                                    # The game engine you waited for

# Kubernetes
brew 'kubectl'                                  # Kubernetes command-line interface
brew 'kubernetes-cli'                           # Kubernetes command-line interface
brew 'stern'                                    # Tail multiple Kubernetes pods & their containers

################################################################################
# Fun
################################################################################

cask "steam"                                    # Steam client
cask "parsec"                                   # Online low latency gaming
