tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "neovim/neovim"
brew "ack"
brew "aspell"
brew "autoconf"
brew "automake"
brew "boot-clj"
brew "node"
brew "bower"
brew "gettext"
brew "cairo"
brew "cmake"
brew "csshx"
brew "dbus", restart_service: true
brew "libgpg-error"
brew "libksba"
brew "pth"
brew "dirmngr"
brew "elm"
brew "gmp"
brew "libcroco"
brew "libtasn1"
brew "libtool"
brew "libunistring"
brew "nettle"
brew "xz"
brew "emacs", args: ["with-cocoa", "with-gnutls", "with-imagemagick@6", "with-librsvg"]
brew "exercism"
brew "fabric"
brew "lame"
brew "xvid"
brew "ffmpeg"
brew "fzf"
brew "gdbm"
brew "ghostscript"
brew "gifsicle"
brew "git-flow"
brew "git-secret"
brew "libusb"
brew "gnupg", link: false
brew "gpg-agent"
brew "gradle"
brew "graphviz"
brew "haskell-stack"
brew "htop"
brew "imagemagick"
brew "jenv"
brew "oniguruma"
brew "jq"
brew "leiningen"
brew "libevent"
brew "librsvg"
brew "libtermkey"
brew "libusb-compat"
brew "libuv"
brew "libvterm"
brew "llvm@3.8"
brew "lua"
brew "markdown"
brew "maven"
brew "minimal-racket"
brew "msgpack"
brew "sqlite"
brew "mycli"
brew "mysql-connector-c"
brew "ncdu"
brew "unibilium"
brew "neovim"
brew "nethogs"
brew "packer"
brew "pandoc"
brew "pcre2"
brew "planck"
brew "python3"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "riemann"
brew "rlwrap"
brew "sbt"
brew "scala"
brew "shellcheck"
brew "sqlparse"
brew "terraform"
brew "texinfo"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "utf8proc"
brew "watch"
brew "wget"
brew "yarn"
brew "zsh"
cask "anki"
cask "basictex"
cask "dropbox"
cask "firefox"
cask "gitkraken"
cask "iterm2"
cask "java7"
cask "karabiner"
cask "yed"
cask "caskroom/fonts/font-fira-code"
cask "caskroom/fonts/font-fira-mono"
cask "caskroom/fonts/font-fira-mono-for-powerline"
cask "caskroom/fonts/font-fira-sans"
