################################################################################
# Applications
################################################################################

# Basics
cask "google-chrome"                            # Cross-platform web browser

# IDEs
cask "cursor"                                   # Write, edit, and chat about your code with AI

# Video conferencing
cask "zoom"                                     # Video communication and virtual meeting platform

################################################################################
# Utilities
################################################################################

cask "rar"                                      # Archive manager for data compression and backups
brew "yt-dlp"                                   # Feature-rich command-line audio/video downloader

################################################################################
# Development
################################################################################

# Copilots
cask "claude-code"                              # Terminal-based AI coding assistant

# EmptyEpsilon
tap "stubillwhite/homebrew-formulae"
brew "cmake@3.31"                               # Cross-platform make
brew "sdl2"                                     # Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "mingw-w64"                                # Minimalist GNU for Windows and GCC cross-compilers
brew "llvm"                                     # Next-gen compiler infrastructure
brew "libopusenc"                               # Convenience library for creating .opus files
brew "sfml@2"                                   # Multi-media library with bindings for multiple languages
brew "glm"                                      # C++ mathematics library for graphics software

# Game development
brew "xcodes"                                   # Best command-line tool to install and switch between multiple versions of Xcode
cask "blender"                                  # 3D creation suite
cask "dotnet-sdk"                               # .NET SDK
cask "unity"                                    # Unity Editor
cask "unity-hub"                                # Unity Hub

# Game dev
cask "godot"                                    # The game engine you waited for

# Kubernetes
brew 'kubectl'                                  # Kubernetes command-line interface
brew 'kubernetes-cli'                           # Kubernetes command-line interface
brew 'stern'                                    # Tail multiple Kubernetes pods & their containers

################################################################################
# Fun
################################################################################

cask "steam"                                    # Steam client
cask "parsec"                                   # Online low latency gaming

brew "nethack"                                  # Single-player roguelike video game
brew "brogue"                                   # Roguelike game
brew "angband"                                  # Dungeon exploration game

# Currently disabled -- required obsolete Lua
# brew "stone-soup"                               # Dungeon Crawl Stone Soup: a roguelike game
