################################################################################
# Prerequisites
################################################################################

tap "homebrew/bundle"

################################################################################
# Applications
################################################################################

# Java
cask "temurin@8"                                # JDK 8 LTS from https://adoptium.net/
cask "temurin@11"                               # JDK 11 LTS from https://adoptium.net/
cask "temurin@17"                               # JDK 17 LTS from https://adoptium.net/
cask "temurin@21"                               # JDK 21 LTS from https://adoptium.net/
cask "temurin"                                  # Latest JDK from https://adoptium.net/

# Basics
cask "bartender"                                # Take control of your menu bar
cask "beyond-compare@beta"                      # Compare files and folders
cask "dropbox"                                  # Client for the Dropbox cloud storage service
cask "firefox"                                  # Mozilla Firefox
cask "google-chrome"                            # Cross-platform web browser
cask "iterm2"                                   # Terminal emulator as alternative to Apple's Terminal app
cask "orion"                                    # WebKit based web browser
cask "syncthing"                                # Open source continuous file synchronization application

# IDEs
cask "intellij-idea-ce"                         # IDE for Java programming - Community Edition
cask "pycharm-ce"                               # IDE for Python programming - Community Edition
cask "visual-studio-code"                       # Open-source code editor

# Database clients
cask 'dbeaver-community'                        # Free universal database tool and SQL client

# Screen capture
cask "licecap"                                  # Animated screen capture application

# Encryption
brew "gnupg"                                    # GNU Pretty Good Privacy (PGP) package
cask "gpg-suite"                                # GPG Suite
cask "keepassxc"                                # Password manager app

# Notebook
cask "evernote"                                 # App for note taking, organizing, task lists, and archiving
cask 'obsidian'                                 # Markdown note management

# APIs
cask "bruno"                                    # Opensource IDE for exploring and testing api's

# eBooks
cask "kindle"                                   # Kindle for Mac

# Presentations
brew "marp-cli"                                 # Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
cask "deckset"                                  # Presentations from Markdown

################################################################################
# Utilities
################################################################################

brew "cmake"                                    # Cross-platform make
brew "cookiecutter"                             # Utility that creates projects from templates
brew "coreutils"                                # GNU File, Shell, and Text utilities
brew "ctags"                                    # Reimplementation of ctags(1)
brew "datamash"                                 # Tool to perform numerical, textual & statistical operations
brew "direnv"                                   # Load/unload environment variables based on $PWD
brew "entr"                                     # Run arbitrary commands when files change
brew "fd"                                       # Simple, fast and user-friendly alternative to find
brew "findutils"                                # Collection of GNU find, xargs, and locate
brew "fzf"                                      # Command-line fuzzy finder written in Go
brew "gnu-sed"                                  # GNU implementation of the famous stream editor
brew "gnuplot"                                  # Command-driven, interactive function plotting
brew "graphviz"                                 # Graph visualization software from AT&T and Bell Labs
brew "htop"                                     # Improved top (interactive process viewer)
brew "jq"                                       # Lightweight and flexible command-line JSON processor
brew "miller"                                   # Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "ncdu"                                     # NCurses Disk Usage
brew "neovim"                                   # Ambitious Vim-fork focused on extensibility and agility
brew "openssh"                                  # OpenBSD freely-licensed SSH connectivity tools
brew "parallel"                                 # Shell command parallelization utility
brew "pkg-config"                               # Manage compile and link flags for libraries
brew "pygments"                                 # Generic syntax highlighter
brew "python-yq"                                # Command-line YAML and XML processor that wraps jq
#brew "q"                                        # Run SQL directly on CSV or TSV files
brew "ripgrep"                                  # Search tool like grep and The Silver Searcher
brew "sampler"                                  # Tool for shell commands execution, visualization and alerting
brew "slackcat"                                 # Command-line utility for posting snippets to Slack
brew "slackdump"                                # Export Slack data without admin privileges
brew "tesseract"                                # OCR (Optical Character Recognition) engine
brew "tree"                                     # Display directories as trees (with optional color/HTML output)
brew "watch"                                    # Executes a program periodically, showing output fullscreen
brew "wget"                                     # Internet file retriever
brew "xsv"                                      # Fast CSV toolkit written in Rust
brew "zsh"                                      # UNIX shell (command interpreter)
cask "mitmproxy"                                # Intercept, modify, replay, save HTTP/S traffic
cask "raycast"                                  # Control your tools with a few keystrokes
cask "scroll-reverser"                          # Tool to reverse the direction of scrolling

# Document and image manipulation
brew "imagemagick"                              # Tools and libraries to manipulate images in many formats
brew "pandoc"                                   # Swiss-army knife of markup format conversion
brew "pngpaste"                                 # Paste PNG into files
cask "quarto"                                   # Scientific and technical publishing system built on Pandoc

# tmux
brew "tmux"                                     # Terminal multiplexer
brew "tmuxinator"                               # Manage complex tmux sessions easily
brew "reattach-to-user-namespace"               # Reattach process (e.g., tmux) to background

# Terminal plotting
tap "rs/tap"
brew "jaggr"                                    # JSON Aggregation CLI
brew "jplot"                                    # iTerm2 expvar/JSON monitoring tool

# OSX scripting
cask "hammerspoon"                              # Desktop automation application

################################################################################
# Development
################################################################################

# Fonts
<<<<<<< HEAD
=======
tap "homebrew/cask-fonts"
>>>>>>> a7ca844 (OSX Sequoia migration)
cask "font-fantasque-sans-mono"                 # A font family with a great monospaced variant for programmers

# Version control
brew "bfg"                                      # Remove large files or passwords from Git history like git-filter-branch
brew "gh"                                       # GitHub command-line tool
brew "act"                                      # Run your GitHub Actions locally
brew "git"                                      # Distributed revision control system
brew "git-delta"                                # Syntax-highlighting pager for git and diff output
brew "git-filter-repo"                          # Quickly rewrite git repository history
brew "git-lfs"                                  # Git extension for versioning large files
brew "git-secret"                               # Bash-tool to store the private data inside a git repo

tap "stubillwhite/homebrew-formulae"
cask "gitup"                                    # Git interface focused on visual interaction

# Java
brew "gradle"                                   # Open-source build automation tool based on the Groovy and Kotlin DSL
brew "maven"                                    # Java-based project management
cask "visualvm"                                 # JVM visualiser

# Clojure
brew "leiningen"                                # Build tool for Clojure

# Scala
brew "ammonite-repl"                            # Ammonite is a cleanroom re-implementation of the Scala REPL
brew "mill"                                     # Scala build tool
brew "sbt"                                      # Build tool for Scala projects
brew "scala"                                    # JVM-based programming language
brew "coursier"                                 # Pure Scala Artifact Fetching 

# Haskell
brew "cabal-install"                            # Command-line interface for Cabal and Hackage
brew "ghcup"                                    # Installer for the general purpose language Haskell
brew "haskell-stack"                            # The Haskell Tool Stack

# Groovy
brew "groovy"                                   # Java-based scripting language

# Python
brew "mypy"                                     # Experimental optional static type checker for Python
brew "pipx"                                     # Execute binaries from Python packages in isolated environments
brew "python"                                   # Interpreted, interactive, object-oriented programming language
brew "python@3.9"                               # Interpreted, interactive, object-oriented programming language
brew "python@3.10"                              # Interpreted, interactive, object-oriented programming language
brew "ruff"                                     # Extremely fast Python linter, written in Rust
brew "ruff-lsp"                                 # Language Server Protocol implementation for Ruff

# Elm
brew "elm"                                      # Functional programming language for building browser-based GUIs

# Go
brew "go"                                       # Open source programming language to build simple/reliable/efficient software

# Lua
brew "lua-language-server"                      # Language Server for the Lua language

# Ruby
brew "ruby"                                     # Powerful, clean, object-oriented scripting language

# DuckDB
brew "duckdb"                                   # Embeddable SQL OLAP Database Management System

# Javascript
brew "node"                                     # platform built on v8 to build network applications

# AWS
brew "awscli"                                   # Official Amazon AWS command-line interface
brew "awslogs"                                  # Simple command-line tool to read AWS CloudWatch logs
brew "terraform", link: false                   # Tool to build, change, and version infrastructure
brew "terragrunt"                               # Thin wrapper for Terraform e.g. for locking state
brew "tfenv", link: true                        # Terraform version manager inspired by rbenv

# Azure
tap "azure/azd"
brew "azd"                                      # Azure Developer CLI
brew "azure-cli"                                # Microsoft Azure CLI 2.0

# SQL
cask "sequel-pro"                               # MySQL/MariaDB database management platform
cask "sqlworkbenchj"                            # Java-based SQL client

# Shell
brew "bats-core"                                # Bash Automated Testing System

# Linters
brew "aspell"                                   # Spell checker with better logic than ispell
brew "shellcheck"                               # Static analysis and lint tool, for (ba)sh scripts
brew "sqlfluff"                                 # SQL linter and auto-formatter for Humans
brew "vale"                                     # Syntax-aware linter for prose
brew "yamllint"                                 # Linter for YAML files

################################################################################
# Fun
################################################################################

cask "anki"                                     # Memory training application
cask "spotify"                                  # Spotify client

brew "nethack"                                  # Single-player roguelike video game
brew "brogue"                                   # Roguelike game
brew "angband"                                  # Dungeon exploration game

# Currently disabled -- required obsolete Lua
# brew "stone-soup"                               # Dungeon Crawl Stone Soup: a roguelike game
