tap "adoptopenjdk/openjdk"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "neovim/neovim"
brew "ack"
brew "ansifilter"
brew "aspell"
brew "autoconf"
brew "automake"
brew "libyaml"
brew "sqlite"
brew "python"
brew "awscli"
brew "boot-clj"
brew "icu4c"
brew "node"
brew "bower"
brew "cabal-install"
brew "fontconfig"
brew "gettext"
brew "cmake"
brew "coreutils"
brew "csshx"
brew "dbus", restart_service: true
brew "libksba"
brew "pth"
brew "dirmngr"
brew "elm"
brew "nettle"
brew "gnutls"
brew "emacs", args: ["with-cocoa", "with-imagemagick@6", "with-librsvg"]
brew "entr"
brew "exercism"
brew "fabric"
brew "lame"
brew "xvid"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gcc"
brew "ghostscript"
brew "gifsicle"
brew "git"
brew "git-flow"
brew "gnupg"
brew "git-secret"
brew "go"
brew "python@2"
brew "gobject-introspection"
brew "gource"
brew "gperftools"
brew "gpg-agent"
brew "gradle"
brew "grafana", link: false
brew "graphite2"
brew "libtool"
brew "graphviz"
brew "harfbuzz"
brew "haskell-stack"
brew "htop"
brew "imagemagick"
brew "jq"
brew "leiningen"
brew "leveldb"
brew "libcroco"
brew "libevent"
brew "pango"
brew "librsvg"
brew "libtermkey"
brew "libusb-compat"
brew "libvterm"
brew "lua"
brew "markdown"
brew "maven"
brew "mill"
brew "minimal-racket"
brew "ncdu"
brew "neovim"
brew "nethack"
brew "nethogs"
brew "openssh"
brew "packer"
brew "pandoc"
brew "proselint"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "riemann"
brew "rlwrap"
brew "ruby", link: true
brew "sbt"
brew "scala"
brew "shellcheck"
brew "slackcat"
brew "sqlparse"
brew "terraform"
brew "texinfo"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "utf8proc"
brew "watch"
brew "wget"
brew "yamllint"
brew "yarn"
brew "zsh"
cask "anki"
cask "basictex"
cask "dash"
cask "dropbox"
cask "eclipse-java"
cask "firefox"
cask "flux"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-sans"
cask "gitkraken"
cask "iterm2"
cask "karabiner"
cask "libreoffice"
cask "licecap"
cask "openoffice"
cask "postman"
cask "skype"
cask "sqlworkbenchj"
cask "yed"
cask "adoptopenjdk/openjdk/adoptopenjdk8"
